Revit 2027 API
Camera.ProjectionMethod Property
 Projection method
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ProjectionMethod ProjectionMethod { get; set; }
Public Property ProjectionMethod As ProjectionMethod
	Get
	Set
public:
property ProjectionMethod ProjectionMethod {
	ProjectionMethod get ();
	void set (ProjectionMethod value);
}
member ProjectionMethod : ProjectionMethod with get, set
Property Value
ProjectionMethod
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace